XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAMG_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>SAMG_DFP</name>
  <description>Microchip SAMG Series Device Support and Examples</description>

  <releases>
    <release version="1.2.1" date="2020-10-21" deprecated="2020-10-21">
      This pack is going to be deprecated. Device Support is maintained by Microchip going forward.
      Updated MDK Examples have been moved to respective board support packs (BSP) from Keil.
      Please remove this pack and install the following packs:
      - Microchip.SAMG_DFP.3.3.42.atpack and Keil.SAMG_BSP.1.0.0
    </release>
    <release version="1.2.0" date="2018-05-15">
      Updated device vendor from Atmel to Microchip.
      Updated system file with corrected SystemCoreClock initial value to value set by SystemInit function
      Added Arduino Quattro board support.
    </release>
    <release version="1.1.0" date="2015-01-09">
      Added SAMG54 and SAMG55 Devices.
      Updated SAMG5x device support files.
    </release>
    <release version="1.0.0">
      First Release version of SAMG Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>Microchip</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Microchip</keyword>
    <keyword>SAMG</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="SAMG Series" Dvendor="Microchip:3">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1"/>
      <book    name="Documents\dui0553a_cortex_m4_dgug.pdf"           title="Cortex-M4 Generic User Guide"/>
      <book    name="http://www.atmel.com/products/microcontrollers/arm/sam-g.aspx" title="SAMG Documents"/>
      <description>
The SAM G family is optimized for ultra-low-power and high-performance applications.
Its small form factor is based on an ARM Cortex-M4 core and, bundled with a
floating point unit (FPU), these devices offer unrivaled efficiency in a tiny
3 x 3 mm, 49-ball WLCSP package. The SAM G family is optimized with a highly-efficient
set of serial peripherals including a 12-bit ADC, DMA, and a good SRAM-to-flash ratio.
SAM G devices are ideal for sensor hub and battery-operated consumer applications.
	  </description>
      <!-- ******************************  SAMG51  ****************************** -->
      <subFamily DsubFamily="SAMG51">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="48000000"/>

        <feature    type="IOs"        n="34"/>
        <feature    type="ExtInt"     n="16"/>
        <feature    type="SPI"        n="2"/>
        <feature    type="UART"       n="2"/>
        <feature    type="USART"      n="1"/>
        <feature    type="ComOther"   n="3"               name="Two-wire Interface"/>
        <feature    type="ADC"        n="8"    m="12"/>
        <feature    type="Timer"      n="3"    m="16"/>
		<feature    type="TimerOther" n="1"               name="Real-time Timer"/>
        <feature    type="RTC"        n="32768"/>
		<feature    type="WDT"        n="1"/>
        <feature    type="DMA"        n="18"              name="Peripheral DMA"/>
        <feature    type="CoreOther"  n="1"               name="Chip Identifier"/>
        <feature    type="Temp"       n="-40"  m="85"     name="Industrial Temperature Range"/>

		<!-- ******************************  ATSAMG51G18  ****************************** -->
        <device Dname="ATSAMG51G18">
          <compile header="Device\Include\SAMG51\samg51.h"  define="__SAMG51G18__"/>
          <debug      svd="SVD\SAMG51\ATSAMG51G18.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\ATSAMG_256.FLM"     start="0x00400000"  size="0x40000"                  default="1"/>

          <feature    type="CSP"        n="49"         name="Wafer-Level Chip-Scale Package"/>
        </device>

        <!-- ******************************  ATSAMG51N18  ****************************** -->
        <device Dname="ATSAMG51N18">
          <compile header="Device\Include\SAMG51\samg51.h"  define="__SAMG51N18__"/>
          <debug      svd="SVD\SAMG51\ATSAMG51N18.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x40000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\ATSAMG_256.FLM"     start="0x00400000"  size="0x40000"                  default="1"/>

          <feature    type="QFP"        n="100"        name="Low-Profile QFP Package"/>
        </device>
      </subFamily>

      <!-- ******************************  SAMG53  ****************************** -->
      <subFamily DsubFamily="SAMG53">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="48000000"/>

        <feature    type="IOs"        n="34"/>
        <feature    type="ExtInt"     n="16"/>
        <feature    type="SPI"        n="2"/>
        <feature    type="UART"       n="2"/>
        <feature    type="USART"      n="1"/>
        <feature    type="ComOther"   n="3"               name="Two-wire Interface"/>
        <feature    type="I2S"        n="2"               name="Inter-IC Sound Interface"/>
        <feature    type="ComOther"   n="1"               name="Pulse Density Modulation Interface"/>
        <feature    type="ADC"        n="6"    m="12"/>
        <feature    type="Timer"      n="6"    m="16"/>
		<feature    type="TimerOther" n="1"               name="Real-time Timer"/>
        <feature    type="RTC"        n="32768"/>
		<feature    type="WDT"        n="1"/>
        <feature    type="DMA"        n="18"              name="Peripheral DMA"/>
        <feature    type="CoreOther"  n="1"               name="Chip Identifier"/>
        <feature    type="Temp"       n="-40"  m="85"     name="Industrial Temperature Range"/>

