XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAMG_DFP.pdsc
		<!-- ******************************  ATSAMG53G19  ****************************** -->
        <device Dname="ATSAMG53G19">
          <compile header="Device\Include\SAMG53\samg53.h"  define="__SAMG53G19__"/>
          <debug      svd="SVD\SAMG53\ATSAMG53G19.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\ATSAMG_512.FLM"     start="0x00400000"  size="0x80000"                  default="1"/>

          <feature    type="CSP"        n="49"         name="Wafer-Level Chip-Scale Package"/>
        </device>

        <!-- ******************************  ATSAMG53N19  ****************************** -->
        <device Dname="ATSAMG53N19">
          <compile header="Device\Include\SAMG53\samg53.h"  define="__SAMG53N19__"/>
          <debug      svd="SVD\SAMG53\ATSAMG53N19.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\ATSAMG_512.FLM"     start="0x00400000"  size="0x80000"                  default="1"/>

        </device>
      </subFamily>

      <!-- ******************************  SAMG54  ****************************** -->
      <subFamily DsubFamily="SAMG54">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="96000000"/>

        <feature    type="IOs"        n="38"/>
        <feature    type="ExtInt"     n="16"/>
        <feature    type="SPI"        n="1"/>
        <feature    type="UART"       n="2"/>
        <feature    type="USART"      n="1"/>
        <feature    type="ComOther"   n="3"              name="Two-wire Interface"/>
        <feature    type="I2S"        n="2"              name="Inter-IC Sound Interface"/>
        <feature    type="ComOther"   n="1"              name="Pulse Density Modulation Interface"/>
        <feature    type="ComOther"   n="3"              name="TWI Interface"/>
        <feature    type="ADC"        n="8"    m="12"/>
        <feature    type="Timer"      n="6"    m="16"/>
		<feature    type="TimerOther" n="1"               name="Real-time Timer"/>
        <feature    type="RTC"        n="32768"/>
		<feature    type="WDT"        n="1"/>
        <feature    type="DMA"        n="18"              name="Peripheral DMA"/>
        <feature    type="CoreOther"  n="1"               name="Chip Identifier"/>
        <feature    type="Temp"       n="-40"  m="85"     name="Industrial Temperature Range"/>

		<!-- ******************************  ATSAMG54G19  ****************************** -->
        <device Dname="ATSAMG54G19">
          <compile header="Device\Include\SAMG54\samg54.h"  define="__SAMG54G19__"/>
          <debug      svd="SVD\SAMG54\ATSAMG54G19.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\ATSAMG_512.FLM"     start="0x00400000"  size="0x80000"                  default="1"/>

          <feature    type="CSP"        n="49"         name="Wafer-Level Chip-Scale Package"/>
        </device>

        <!-- ******************************  ATSAMG54J19  ****************************** -->
        <device Dname="ATSAMG54J19">
          <compile header="Device\Include\SAMG54\samg54.h"  define="__SAMG54J19__"/>
          <debug      svd="SVD\SAMG54\ATSAMG54J19.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\ATSAMG_512.FLM"     start="0x00400000"  size="0x80000"                  default="1"/>

          <feature    type="QFN"        n="64"        name="QFN Package"/>
        </device>

        <!-- ******************************  ATSAMG54N19  ****************************** -->
        <device Dname="ATSAMG54N19">
          <compile header="Device\Include\SAMG54\samg54.h"  define="__SAMG54N19__"/>
          <debug      svd="SVD\SAMG54\ATSAMG54N19.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x18000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\ATSAMG_512.FLM"     start="0x00400000"  size="0x80000"                  default="1"/>

          <feature    type="QFP"        n="100"        name="Low-Profile QFP Package"/>
        </device>
      </subFamily>

      <!-- ******************************  SAMG55  ****************************** -->
      <subFamily DsubFamily="SAMG55">
        <processor Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="120000000"/>

        <feature type="ExtInt"     n="16"/>
        <feature type="I2S"        n="2"              name="Inter-IC Sound Interface"/>
        <feature type="ComOther"   n="1"              name="Pulse Density Modulation Interface"/>
        <feature type="ADC"        n="8"    m="12"/>
		<feature type="USBD"       n="1"              name="USB Device"/>
		<feature type="USBH"       n="1"              name="USB Host"/>
        <feature type="Timer"      n="6"    m="16"/>
		<feature type="TimerOther" n="1"               name="Real-time Timer"/>
        <feature type="RTC"        n="32768"/>
		<feature type="WDT"        n="1"/>
        <feature type="DMA"        n="18"              name="Peripheral DMA"/>
        <feature type="CoreOther"  n="1"               name="Chip Identifier"/>
        <feature type="Temp"       n="-40"  m="85"     name="Industrial Temperature Range"/>

