XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAMG_DFP.pdsc
		<!-- ******************************  ATSAMG55G19  ****************************** -->
        <device Dname="ATSAMG55G19">
          <compile header="Device\Include\SAMG55\samg55.h"  define="__SAMG55G19__"/>
          <debug svd="SVD\SAMG55\ATSAMG55G19.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x28000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\ATSAMG_512.FLM"     start="0x00400000"  size="0x80000"                  default="1"/>

          <feature type="IOs"        n="38"/>
          <feature type="SPI"        n="7"/>
          <feature type="USART"      n="7"/>
          <feature type="ComOther"   n="7"              name="Two-wire Interface"/>
          <feature type="CSP"        n="49"             name="Wafer-Level Chip-Scale Package"/>
        </device>

        <!-- ******************************  ATSAMG55J19  ****************************** -->
        <device Dname="ATSAMG55J19">
          <compile header="Device\Include\SAMG55\samg55.h"  define="__SAMG55J19__"/>
          <debug svd="SVD\SAMG55\ATSAMG55J19.svd"/>
          <memory     id="IROM1"                      start="0x00400000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x28000"    init   ="0"   default="1"/>
          <algorithm  name="Flash\ATSAMG_512.FLM"     start="0x00400000"  size="0x80000"                  default="1"/>

          <feature type="IOs"        n="48"/>
          <feature type="SPI"        n="8"/>
          <feature type="USART"      n="8"/>
          <feature type="ComOther"   n="8"              name="Two-wire Interface"/>
          <feature type="QFN"        n="64"             name="QFN Package"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->

    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- ****************************** SAMG51 ****************************** -->
    <condition id="SAMG51 CMSIS">
      <description>Microchip SAMG51 Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Microchip:3"/>
      <accept  Dname="ATSAMG51*"/>
    </condition>

    <!-- ****************************** SAMG53 ****************************** -->
    <condition id="SAMG53 CMSIS">
      <description>Microchip SAMG53 Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Microchip:3"/>
      <accept  Dname="ATSAMG53*"/>
    </condition>

    <!-- ****************************** SAMG54 ****************************** -->
    <condition id="SAMG54 CMSIS">
      <description>Microchip SAMG54 Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Microchip:3"/>
      <accept  Dname="ATSAMG54*"/>
    </condition>

    <!-- ****************************** SAMG55 ****************************** -->
    <condition id="SAMG55 CMSIS">
      <description>Microchip SAMG55 Devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="Microchip:3"/>
      <accept  Dname="ATSAMG55*"/>
    </condition>
  </conditions>

  <components>
    <!-- Startup SAMG51 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SAMG51 CMSIS">
      <description>System Startup for Microchip SAMG51 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\SAMG51\"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_SAMG51.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_samg51.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup SAMG53 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SAMG53 CMSIS">
      <description>System Startup for Microchip SAMG53 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\SAMG53\"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_SAMG53.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_samg53.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup SAMG54 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SAMG54 CMSIS">
      <description>System Startup for Microchip SAMG54 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\SAMG54\"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_SAMG54.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_samg54.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- Startup SAMG55 -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="SAMG55 CMSIS">
      <description>System Startup for Microchip SAMG55 Devices</description>
      <files>
        <!-- include folder / file -->
        <file category="include" name="Device\Include\SAMG55\"/>
        <!-- startup / system file -->
        <file category="source" name="Device\Source\ARM\startup_SAMG55.s" attr="config" version="1.0.0" condition="Compiler ARMCC"/>
        <file category="source" name="Device\Source\system_samg55.c"      attr="config" version="1.0.0"/>
      </files>
    </component>

    <!-- SAMG55-XPRO Board Support -->
    <bundle Cbundle="SAMG55-XPRO" Cclass="Board Support" Cversion="1.0.0">
      <description>Microchip SAMG55-XPRO Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="SAMG55 CMSIS">
      <description>LED driver for Microchip SAMG55-XPRO Board</description>
        <files>
          <file category="source" name="Boards\Atmel\SAMG55-XPRO\Common\LED_SAMG55-XPRO.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="SAMG55 CMSIS">
      <description>Button driver for Microchip SAMG55-XPRO Board</description>
        <files>
          <file category="source" name="Boards\Atmel\SAMG55-XPRO\Common\Buttons_SAMG55-XPRO.c"/>
        </files>
      </component>
    </bundle>

