XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Keil.SAMG_DFP.pdsc
    <!-- Arduino-Quattro Board Support -->
    <bundle Cbundle="Arduino-Quattro" Cclass="Board Support" Cversion="1.0.0">
      <description>Microchip Arduino-Quattro Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="SAMG55 CMSIS">
      <description>LED driver for Microchip SAMG55-XPRO Board</description>
        <files>
          <file category="source" name="Boards\Atmel\Arduino-Quattro\Common\LED_Arduino-Quattro.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="SAMG55 CMSIS">
      <description>Button driver for Microchip Arduino-Quattro Board</description>
        <files>
          <file category="source" name="Boards\Atmel\Arduino-Quattro\Common\Buttons_Arduino-Quattro.c"/>
        </files>
      </component>
    </bundle>

  </components>

  <boards>
    <board vendor="Microchip" name="SAMG55-XPRO" revision="Rev.2" salesContact="http://www.atmel.com/buy/contact_us.aspx?contactType=Sales%20Representative">
      <description>Microchip SAM G55 Xplained Pro Evaluation Kit</description>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAMG55J19"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" DsubFamily="SAMG55"/>
	    <feature type="ODbg"      n="1"              name="Embedded Debugger USB"/>
		<feature type="XTAL"      n="32768"/>
	    <feature type="PWR"       n="5"              name="USB Powered (from the Debugger)"/>
	    <feature type="PWR"       n="5"              name="External Power"/>
	    <feature type="DIO"       n="3"              name="Xplained Pro Extension headers"/>
	    <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
	    <feature type="LED"       n="1"              name="Yellow User LED"/>
      <debugInterface adapter="Embedded Debugger" connector="Micro-USB"/>
    </board>

    <board vendor="Microchip" name="Arduino-Quattro" revision="Rev.2" salesContact="http://www.atmel.com/buy/contact_us.aspx?contactType=Sales%20Representative">
      <description>Microchip Arduino Quattro development board</description>
      <mountedDevice    deviceIndex="0" Dvendor="Microchip:3" Dname="ATSAMG55J19"/>
      <compatibleDevice deviceIndex="0" Dvendor="Microchip:3" DsubFamily="SAMG55"/>
	    <feature type="ODbg"      n="1"              name="Embedded Debugger USB"/>
		<feature type="XTAL"      n="32768"/>
	    <feature type="PWR"       n="5"              name="USB Powered (from the Debugger)"/>
        <feature type="USB"       n="2"              name="EDBG, MCU-USB"/>
	    <feature type="DIO"       n="3"              name="Xplained Pro Extension headers"/>
        <feature type="DIO"       n="28"             name="Digital IOs on 2 x 14 pin header"/>
	    <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
	    <feature type="LED"       n="2"              name="Yellow, Green User LED"/>
      <debugInterface adapter="Embedded Debugger" connector="Micro-USB"/>
    </board>
  </boards>

  <examples>
    <!-- SAMG55-XPRO Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Atmel\SAMG55-XPRO\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="SAMG55-XPRO" vendor="Microchip"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="Blinky" doc="Abstract.txt" folder="Boards\Atmel\SAMG55-XPRO\Blinky">
      <description>Blinky example</description>
      <board name="SAMG55-XPRO" vendor="Microchip"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- Arduino-Quattro Board -->
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Atmel\Arduino-Quattro\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="Arduino-Quattro" vendor="Microchip"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="Blinky" doc="Abstract.txt" folder="Boards\Atmel\Arduino-Quattro\Blinky">
      <description>Blinky example</description>
      <board name="Arduino-Quattro" vendor="Microchip"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>

</package>
